reddit_clone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ibNSGbg5yNX3g9rAPHhnLw=="], ["updated_at", "2020-12-14 20:03:51.104519"], ["id", 41]]

    def self.find_by_credentials(u,p)
        user = self.find_by(username: u)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "my_pass1"], ["LIMIT", 1]]