reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)


        if @sub.save
---
INSERT INTO "subs" ("title", "moderator_id", "description") VALUES ($1, $2, $3) RETURNING "id"  [["title", "dogs"], ["moderator_id", 41], ["description", "            \r\n        awefwa"]]

    def show
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]